using System;

/*Задача 34: Задайте массив заполненный случайными положительными трёхзначными числами. Напишите программу, которая покажет количество чётных чисел в массиве.

[345, 897, 568, 234] -> 2*/



/*Задача 36: Задайте одномерный массив, заполненный случайными числами. Найдите сумму элементов, стоящих на нечётных позициях.

[3, 7, 23, 12] -> 19

[-4, -6, 89, 6]-> 0*/



/*Задача 38: Задайте массив вещественных чисел. Найдите разницу между максимальным и минимальным элементов массива.

[3 7 22 2 78] -> 76*/
int x 
/*int[] numbers = new int[numbr];
Console.Write("[ ");
for (int i = 0; i < numbers.Length; i++)
{
    int a = new Random().Next(100, 1000);
    numbers[i] = a;
    Console.Write($"{numbers[i]} ");
}

int min = numbers.Min();
int max = numbers.Max();

Console.Write($"] -> {max - min}");*/